package qws.one


//
object App0 {

    @JvmStatic
    fun main(args: Array<String>) {
        println("${this::class.simpleName} args.size=${args.size} args=${args.toList()}")
//        Bean.Poem from """
        Bean.Creation silentFrom """
            Тарас Шевченко
            
            
            Садок вишневий коло хати
            
            
            Садок вишневий коло хати ,
            Хрущі над вишнями гудуть .
            Плугатарі з плугами йдуть ,
            Співають , ідучи, дівчата ,
            А матері вечерять ждуть .

            Сім’я вечеря коло хати ,
            Вечірня зіронька встає .
            Дочка вечерять подає ,
            А мати хоче научати ,
            Так соловейко не дає .

            Поклала мати коло хати
            Маленьких діточок своїх ,
            Сама заснула коло їх .
            Затихло все , тілько дівчата
            Та соловейко не затих .
        """.trimIndent()

        Bean.Creation from """
            Тарас Шевченко
            
            
            Встала весна

 
            Встала весна, чорну землю
            Сонну розбудила ,
            Уквітчала її рястом ,
            Барвінком укрила ;
            І на полі жайворонок ,
            Соловейко в гаї
            Землю , убрану весною ,
            Вранці зустрічає .
        """.trimIndent()

//        println("AppA.main ${a.joinToString { """ '' $it '' """ }}")
    }
}